In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('gapminder.tsv', sep ='\t')
df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [3]:
df.values

array([['Afghanistan', 'Asia', 1952, 28.801, 8425333, 779.4453145],
       ['Afghanistan', 'Asia', 1957, 30.331999999999997, 9240934,
        820.8530296],
       ['Afghanistan', 'Asia', 1962, 31.997, 10267083, 853.1007099999999],
       ...,
       ['Zimbabwe', 'Africa', 1997, 46.809, 11404948, 792.4499602999999],
       ['Zimbabwe', 'Africa', 2002, 39.989000000000004, 11926563,
        672.0386227000001],
       ['Zimbabwe', 'Africa', 2007, 43.486999999999995, 12311143,
        469.70929810000007]], dtype=object)

In [4]:
df.shape

(1704, 6)

In [5]:
df.dtypes

country       object
continent     object
year           int64
lifeExp      float64
pop            int64
gdpPercap    float64
dtype: object

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
country      1704 non-null object
continent    1704 non-null object
year         1704 non-null int64
lifeExp      1704 non-null float64
pop          1704 non-null int64
gdpPercap    1704 non-null float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

In [7]:
df.isna().sum()

country      0
continent    0
year         0
lifeExp      0
pop          0
gdpPercap    0
dtype: int64

In [8]:
df.loc[[0,3]]
# the specific index name

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
3  Afghanistan      Asia  1967   34.020  11537966  836.197138

In [9]:
df.iloc[2] 
# the row number

country      Afghanistan
continent           Asia
year                1962
lifeExp           31.997
pop             10267083
gdpPercap        853.101
Name: 2, dtype: object

In [10]:
df.loc[df['year']==1967]

                 country continent  year  lifeExp       pop    gdpPercap
3            Afghanistan      Asia  1967   34.020  11537966   836.197138
15               Albania    Europe  1967   66.220   1984060  2760.196931
27               Algeria    Africa  1967   51.407  12760499  3246.991771
39                Angola    Africa  1967   35.985   5247469  5522.776375
51             Argentina  Americas  1967   65.634  22934225  8052.953021
...                  ...       ...   ...      ...       ...          ...
1647             Vietnam      Asia  1967   47.838  39463910   637.123289
1659  West Bank and Gaza      Asia  1967   51.631   1142636  2649.715007
1671         Yemen, Rep.      Asia  1967   36.984   6740785   862.442146
1683              Zambia    Africa  1967   47.768   3900000  1777.077318
1695            Zimbabwe    Africa  1967   53.995   4995432   569.795071

[142 rows x 6 columns]

In [11]:
df.loc[(df['country']=='Zimbabwe') & (df['pop']>= 1_000_000)
       , ['year', 'pop']]

      year       pop
1692  1952   3080907
1693  1957   3646340
1694  1962   4277736
1695  1967   4995432
1696  1972   5861135
1697  1977   6642107
1698  1982   7636524
1699  1987   9216418
1700  1992  10704340
1701  1997  11404948
1702  2002  11926563
1703  2007  12311143